void setup()
{
     //TCCR1B = TCCR1B & B11111000 | B00000101;    // ปรับ timer 1 divisor เพื่อให้ได้ค่าความถี่ 
                                                                                                      // สัญญาณ PWM ของขา 9,10 ที่ 30.64 Hz

     pinMode(10,OUTPUT);   //กำหนด ขา 10 (ต่ออยู่กับ ENA ให้เป็นแบบ OUTPUT)
     pinMode(9,OUTPUT);   //กำหนด ขา 9 (ต่ออยู่กับ IN1 ให้เป็นแบบ OUTPUT)
     pinMode(8,OUTPUT);   //กำหนด ขา 8 (ต่ออยู่กับ IN2 ให้เป็นแบบ OUTPUT)
}

void loop()
{
     digitalWrite(9,HIGH);      //ตามตารางข้างบน ต้องกำหนด IN1 = HIGH 
     digitalWrite(8,LOW);       //และ IN2 = LOW มอเตอร์ A จึงจะทำงานหมุนไปด้านหน้า
     analogWrite(10,255);       //และสั่งหมุนที่ความเร็วสูงสุด 255 ผ่านทาง ENA (ขา 10) ที่เป็น PWM

     delay(3000);                     //รอเวลา 3 วินาที

     digitalWrite(9,HIGH);       //ตามตารางข้างบน ต้องกำหนด IN1 = HIGH
     digitalWrite(8,HIGH);       //และ IN2 = HIGH มอเตอร์ A จึงจะหยุดการทำงานทันที (เบรค)
     analogWrite(10,0);            //และสั่งความเร็วมอเตอร์ให้เป็น 0 ผ่านทาง ENA (ขา 10) ที่เป็น PWM

     delay(3000);                     //รอเวลา 3 วินาที

     digitalWrite(9,LOW);        //ตามตารางข้างบน ต้องกำหนด IN1 = LOW
     digitalWrite(8,HIGH);       //และ IN2 = HIGH มอเตอร์ A จึงจะทำงานหมุนถอยหลัง
     analogWrite(10,255);         //และสั่งหมุนที่ความเร็วสูงสุด 255 ผ่านทาง ENA (ขา 10) ที่เป็น PWM

     delay(3000);                     //รอเวลา 3 วินาที

     digitalWrite(9,HIGH);       //ตามตารางข้างบน ต้องกำหนด IN1 = HIGH
     digitalWrite(8,HIGH);       //และ IN2 = HIGH มอเตอร์ A จึงจะหยุดการทำงานทันที (เบรค)
     analogWrite(10,0);            //และสั่งความเร็วมอเตอร์ให้เป็น 0 ผ่านทาง ENA (ขา 10) ที่เป็น PWM

     delay(3000);                     //รอเวลา 3 วินาที จบตรงนี้แล้วโค้ดจะเริ่มใหม่ วนไปเรื่อยๆ
}
